# -*- coding: utf-8 -*-
from odoo import models, fields, api

class mkMasterMKJobType(models.Model):
    _name = 'mk.x_master_mk_job_type'
    _description = '[M] ประเภทงาน'

    """
        [M] ประเภทงาน
    """

    ### -----------------------------------------       Field      ------------------------------------------------------
    x_name = fields.Char(string='ประเภทงาน')

    ## ------------------------------------       Compute Function      ------------------------------------------------------
#####---------------------------------------------------------🌟END🌟================================================================#####

class mkMasterMKStatusRevise(models.Model):
    _name = 'mk.x_master_mk_status_revise'
    _description = '[M] สถานะระบบ MD'

    """
        [M] สถานะระบบ MD
    """

    ### -----------------------------------------       Field      ------------------------------------------------------
    x_name = fields.Char(string='สถานะ')

    ## ------------------------------------       Compute Function      ------------------------------------------------------
#####---------------------------------------------------------🌟END🌟================================================================#####

class mkMasterMKResultApprove(models.Model):
    _name = 'mk.x_master_mk_result_approve'
    _description = '[M] ผลการอนุมัติ'

    """
        [M] ผลการอนุมัติ
    """

    ### -----------------------------------------       Field      ------------------------------------------------------
    x_name = fields.Char(string='ผลการอนุมัติ')

    ## ------------------------------------       Compute Function      ------------------------------------------------------
#####---------------------------------------------------------🌟END🌟================================================================#####

class mkMasterMKDuty(models.Model):
    _name = 'mk.x_master_mk_duty'
    _description = '[M] หน้าที่ผู้อนุมัติ'

    """
        [M] หน้าที่ผู้อนุมัติ
    """

    ### -----------------------------------------       Field      ------------------------------------------------------
    x_name = fields.Char(string='Name')
    x_description = fields.Text(string='Duty Description')
    

    ## ------------------------------------       Compute Function      ------------------------------------------------------
#####---------------------------------------------------------🌟END🌟================================================================#####